Revit 2027 API
BuiltInFailures.LooseDimensionFailures.LooseCurtainWallData Property
 Switching element type to a non-Curtain element Family type. All data about Mullions, Grid Lines, and design units for the Curtain element will be lost.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LooseCurtainWallData { get; }
Public Shared ReadOnly Property LooseCurtainWallData As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LooseCurtainWallData {
	FailureDefinitionId^ get ();
}
static member LooseCurtainWallData : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LooseDimensionFailures Class
Autodesk.Revit.DB Namespace